let map = new Map();//за разлика от обекта в този метод ,знаем на коя позиция се намира даден ключ
//тук ключа може да е различен от стринг 
//ако може ще си го обърне към стринг после
map.set('gosho', 6);//добавяне на ключ и стойност
let a = map.get('gosho');//дай ми стойноста на посочения ключ
map.has('gosho')//проверка дали ключа го има в метода.
let entries = map.entries();//за да го обходя го превръщам в масив с този метод.
//после въртя с нормален фор оф
for (const entry of entries) {
    console.log(entry);
}
let newMap = new Map(entries);
console.log(newMap);
let newObj = entries.reduce((a, [key, value]) => {
    a[key] = value;
    return a;
}, {}//същото,като да си създам празен {} и чрез фор оф да го пълня
);//по този начин си пълня обект с reduce
//като започвам от празен обект.
